stress_test_results-dup3-nginx/ab_test_0.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        1837 bytes

Concurrency Level:      500
Time taken for tests:   24.715 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      110650000 bytes
HTML transferred:       91850000 bytes
Requests per second:    2023.08 [#/sec] (mean)
Time per request:       247.148 [ms] (mean)
Time per request:       0.494 [ms] (mean, across all concurrent requests)
Transfer rate:          4372.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.0      0      41
Processing:     2  244 249.4    157    1322
Waiting:        2  244 249.4    156    1321
Total:          2  245 249.3    157    1322

Percentage of the requests served within a certain time (ms)
  50%    157
  66%    239
  75%    361
  80%    498
  90%    678
  95%    730
  98%    794
  99%    953
 100%   1322 (longest request)