stress_test_results-dup3-nginx/wrk_test_1.txt
Running 30s test @ http://localhost:80/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   251.04ms  233.18ms   1.67s    79.88%
    Req/Sec   501.45    134.63     0.87k    67.92%
  119914 requests in 30.07s, 253.65MB read
  Socket errors: connect 3987, read 0, write 0, timeout 0
Requests/sec:   3987.31
Transfer/sec:      8.43MB